MrBlueXav/Horlogeuse/Drivers/BSP/STM32L476G-Discovery/STM32L476_DK_glass_lcd_extension.c
/*
 * STM32L476_DK_glass_lcd_extension.c
 *
 *	********Text encoding must be ISO-8859-1 ! *******
 *
 *  Created on: Mar 20, 2025
 *      Author: Xavier Halgand
 */

/* Includes ------------------------------------------------------------------*/
#include "STM32L476_DK_glass_lcd_extension.h"

/* Global extern variables ---------------------------------------------------*/
extern LCD_HandleTypeDef LCDHandle;
extern const uint16_t CapLetterMap[26];
extern const uint16_t NumberMap[10];
extern uint32_t Digit[4];
extern uint8_t LCDBar;
extern const uint16_t FourteenSegmentASCII_STM32[96];

/* Defines -------------------------------------------------------------------*/
#define ASCII_CHAR_0                  0x30  /* 0 */
#define ASCII_CHAR_AT_SYMBOL          0x40  /* @ */
#define ASCII_CHAR_LEFT_OPEN_BRACKET  0x5B  /* [ */
#define ASCII_CHAR_APOSTROPHE         0x60  /* ` */
#define ASCII_CHAR_LEFT_OPEN_BRACE    0x7B  /* ( */
#define SYMBOL12	(0x5FC9)
#define NON_PRINTABLE_CHARACTER		SYMBOL12

/**************************************************************************************************************/
/**
 * @brief  Convert an ascii char to the a LCD digit.
 * @param  Char: a char to display.
 * @param  Point: a point to add in front of char
 *         This parameter can be: POINT_OFF or POINT_ON
 * @param  Colon : flag indicating if a colon character has to be added in front
 *         of displayed character.
 *         This parameter can be: DOUBLEPOINT_OFF or DOUBLEPOINT_ON.
 * @retval None
 */
static void Convert(uint8_t *Char, Point_Typedef Point, DoublePoint_Typedef Colon)
{
	uint16_t ch = 0;
	uint8_t loop = 0, index = 0;

	switch (*Char)
	{
	case ' ':
		ch = 0x00;
		break;

	case '*':
		ch = C_STAR;
		break;

	case '(':
		ch = C_OPENPARMAP;
		break;

	case ')':
		ch = C_CLOSEPARMAP;
		break;

	case 'd':
		ch = C_DMAP;
		break;

	case 'm':
		ch = C_MMAP;
		break;

	case 'n':
		ch = C_NMAP;
		break;

	case 'µ':
		ch = C_UMAP;
		break;

	case '-':
		ch = C_MINUS;
		break;

	case '+':
		ch = C_PLUS;
		break;

	case '/':
		ch = C_SLATCH;
		break;

	case '°':
		ch = C_PERCENT_1;
		break;

	case '%':
		ch = C_PERCENT_2;
		break;

	case 255:
		ch = C_FULL;
		break;

	case '0':
	case '1':
	case '2':
	case '3':
	case '4':
	case '5':
	case '6':
	case '7':
	case '8':
	case '9':
		ch = NumberMap[*Char - ASCII_CHAR_0];
		break;

	default:
		/* The character Char is one letter in upper case*/
		if ((*Char < ASCII_CHAR_LEFT_OPEN_BRACKET) && (*Char > ASCII_CHAR_AT_SYMBOL))
		{
			ch = CapLetterMap[*Char - 'A'];
		}
		/* The character Char is one letter in lower case*/
		if ((*Char < ASCII_CHAR_LEFT_OPEN_BRACE) && (*Char > ASCII_CHAR_APOSTROPHE))
		{
			ch = CapLetterMap[*Char - 'a'];
		}
		break;
	}

	/* Set the digital point can be displayed if the point is on */
	if (Point == POINT_ON)
	{
		ch |= 0x0002;
	}

	/* Set the "COL" segment in the character that can be displayed if the colon is on */
	if (Colon == DOUBLEPOINT_ON)
	{
		ch |= 0x0020;
	}

	for (loop = 12, index = 0; index < 4; loop -= 4, index++)
	{
		Digit[index] = (ch >> loop) & 0x0f; /*To isolate the less significant digit */
	}
}

/*----------------------------------------------------------------------------*/
uint16_t convert_to_STM32L476DK_glass_LCD(uint16_t code)
{
	uint16_t converted =
			((0x0001 & code) << 10) |
			((0x0002 & code) << 13) |
			((0x0004 & code) <<  7) |
			((0x0008 & code) <<  5) |
			((0x0010 & code) <<  8) |
			((0x0020 & code) <<  6) |
			((0x0040 & code) <<  9) |
			((0x0080 & code) <<  6) |
			((0x0100 & code) >>  5) |
			((0x0200 & code) >>  7) |
			((0x0400 & code) >>  4) |
			((0x0800 & code) >>  4) |
			((0x1000 & code) >>  8) |
			((0x2000 & code) >> 13) |
			((0x4000 & code) >> 13) |
			((0x8000 & code) >> 10);
	return converted;
}

/*----------------------------------------------------------------------------*/
static void Convert2(uint8_t *Char, Point_Typedef Point, DoublePoint_Typedef Colon)
{
	uint16_t ch = 0;
	uint8_t loop = 0, index = 0;

	switch (*Char)
	{

	case 'µ':
		ch = C_UMAP;
		break;

	case '°':
		ch = C_PERCENT_1;
		break;

	default:
		/* The character Char is in extended ASCII table */
		if ((*Char < 145) && (*Char > 31))
		{
			ch = FourteenSegmentASCII_STM32[*Char - 32];
		}
		else ch = NON_PRINTABLE_CHARACTER; /* non printable character */
		break;
	}

	/* Set the digital point can be displayed if the point is on */
	if (Point == POINT_ON)
	{
		ch |= 0x0002;
	}

	/* Set the "COL" segment in the character that can be displayed if the colon is on */
	if (Colon == DOUBLEPOINT_ON)
	{
		ch |= 0x0020;
	}

	for (loop = 12, index = 0; index < 4; loop -= 4, index++)
	{
		Digit[index] = (ch >> loop) & 0x0f; /*To isolate the less significant digit */
	}
}

/*--------------------------------------------------------------------------------------------*/
/**
 * @brief  Write a character in the LCD frame buffer.
 * @param  ch: the character to display.
 * @param  Point: a point to add in front of char
 *         This parameter can be: POINT_OFF or POINT_ON
 * @param  Colon: flag indicating if a colon character has to be added in front
 *         of displayed character.
 *         This parameter can be: DOUBLEPOINT_OFF or DOUBLEPOINT_ON.
 * @param  Position: position in the LCD of the character to write [1:6]
 * @retval None
 */
static void WriteChar(uint8_t *ch, Point_Typedef Point, DoublePoint_Typedef Colon, DigitPosition_Typedef Position)
{
	uint32_t data = 0x00;
	/* To convert displayed character in segment in array digit */
	Convert(ch, (Point_Typedef) Point, (DoublePoint_Typedef) Colon);

	switch (Position)
	{
	/* Position 1 on LCD (Digit1)*/
	case LCD_DIGIT_POSITION_1:
		data = ((Digit[0] & 0x1) << LCD_SEG0_SHIFT) | (((Digit[0] & 0x2) >> 1) << LCD_SEG1_SHIFT)
				| (((Digit[0] & 0x4) >> 2) << LCD_SEG22_SHIFT) | (((Digit[0] & 0x8) >> 3) << LCD_SEG23_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT1_COM0, LCD_DIGIT1_COM0_SEG_MASK, data); /* 1G 1B 1M 1E */

		data = ((Digit[1] & 0x1) << LCD_SEG0_SHIFT) | (((Digit[1] & 0x2) >> 1) << LCD_SEG1_SHIFT)
				| (((Digit[1] & 0x4) >> 2) << LCD_SEG22_SHIFT) | (((Digit[1] & 0x8) >> 3) << LCD_SEG23_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT1_COM1, LCD_DIGIT1_COM1_SEG_MASK, data); /* 1F 1A 1C 1D  */

		data = ((Digit[2] & 0x1) << LCD_SEG0_SHIFT) | (((Digit[2] & 0x2) >> 1) << LCD_SEG1_SHIFT)
				| (((Digit[2] & 0x4) >> 2) << LCD_SEG22_SHIFT) | (((Digit[2] & 0x8) >> 3) << LCD_SEG23_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT1_COM2, LCD_DIGIT1_COM2_SEG_MASK, data); /* 1Q 1K 1Col 1P  */

