MrBlueXav/Horlogeuse/Drivers/BSP/STM32L476G-Discovery/STM32L476_DK_glass_lcd_extension.c
		/* Position 5 on LCD (Digit5)*/
	case LCD_DIGIT_POSITION_5:
		data = (((Digit[0] & 0x2) >> 1) << LCD_SEG9_SHIFT) | (((Digit[0] & 0x4) >> 2) << LCD_SEG14_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM0, LCD_DIGIT5_COM0_SEG_MASK, data); /* 1G 1B 1M 1E */

		data = ((Digit[0] & 0x1) << LCD_SEG8_SHIFT) | (((Digit[0] & 0x8) >> 3) << LCD_SEG15_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM0_1, LCD_DIGIT5_COM0_1_SEG_MASK, data); /* 1G 1B 1M 1E */

		data = (((Digit[1] & 0x2) >> 1) << LCD_SEG9_SHIFT) | (((Digit[1] & 0x4) >> 2) << LCD_SEG14_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM1, LCD_DIGIT5_COM1_SEG_MASK, data); /* 1F 1A 1C 1D  */

		data = ((Digit[1] & 0x1) << LCD_SEG8_SHIFT) | (((Digit[1] & 0x8) >> 3) << LCD_SEG15_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM1_1, LCD_DIGIT5_COM1_1_SEG_MASK, data); /* 1F 1A 1C 1D  */

		data = (((Digit[2] & 0x2) >> 1) << LCD_SEG9_SHIFT) | (((Digit[2] & 0x4) >> 2) << LCD_SEG14_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM2, LCD_DIGIT5_COM2_SEG_MASK, data); /* 1Q 1K 1Col 1P  */

		data = ((Digit[2] & 0x1) << LCD_SEG8_SHIFT) | (((Digit[2] & 0x8) >> 3) << LCD_SEG15_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM2_1, LCD_DIGIT5_COM2_1_SEG_MASK, data); /* 1Q 1K 1Col 1P  */

		data = (((Digit[3] & 0x2) >> 1) << LCD_SEG9_SHIFT) | (((Digit[3] & 0x4) >> 2) << LCD_SEG14_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM3, LCD_DIGIT5_COM3_SEG_MASK, data); /* 1H 1J 1DP 1N  */

		data = ((Digit[3] & 0x1) << LCD_SEG8_SHIFT) | (((Digit[3] & 0x8) >> 3) << LCD_SEG15_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT5_COM3_1, LCD_DIGIT5_COM3_1_SEG_MASK, data); /* 1H 1J 1DP 1N  */
		break;

		/* Position 6 on LCD (Digit6)*/
	case LCD_DIGIT_POSITION_6:
		data = ((Digit[0] & 0x1) << LCD_SEG10_SHIFT) | (((Digit[0] & 0x2) >> 1) << LCD_SEG11_SHIFT)
				| (((Digit[0] & 0x4) >> 2) << LCD_SEG12_SHIFT) | (((Digit[0] & 0x8) >> 3) << LCD_SEG13_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT6_COM0, LCD_DIGIT6_COM0_SEG_MASK, data); /* 1G 1B 1M 1E */

		data = ((Digit[1] & 0x1) << LCD_SEG10_SHIFT) | (((Digit[1] & 0x2) >> 1) << LCD_SEG11_SHIFT)
				| (((Digit[1] & 0x4) >> 2) << LCD_SEG12_SHIFT) | (((Digit[1] & 0x8) >> 3) << LCD_SEG13_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT6_COM1, LCD_DIGIT6_COM1_SEG_MASK, data); /* 1F 1A 1C 1D  */

		data = ((Digit[2] & 0x1) << LCD_SEG10_SHIFT) | (((Digit[2] & 0x2) >> 1) << LCD_SEG11_SHIFT)
				| (((Digit[2] & 0x4) >> 2) << LCD_SEG12_SHIFT) | (((Digit[2] & 0x8) >> 3) << LCD_SEG13_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT6_COM2, LCD_DIGIT6_COM2_SEG_MASK, data); /* 1Q 1K 1Col 1P  */

		data = ((Digit[3] & 0x1) << LCD_SEG10_SHIFT) | (((Digit[3] & 0x2) >> 1) << LCD_SEG11_SHIFT)
				| (((Digit[3] & 0x4) >> 2) << LCD_SEG12_SHIFT) | (((Digit[3] & 0x8) >> 3) << LCD_SEG13_SHIFT);
		HAL_LCD_Write(&LCDHandle, LCD_DIGIT6_COM3, LCD_DIGIT6_COM3_SEG_MASK, data); /* 1H 1J 1DP 1N  */
		break;

	default:
		break;
	}
}

/*--------------------------------------------------------------------------------------------*/
/**
 * @brief  Write a character in the LCD RAM buffer.
 * @param  ch: The character to display.
 * @param  Point: A point to add in front of char.
 *          This parameter can be one of the following values:
 *              @arg POINT_OFF: No point to add in front of char.
 *              @arg POINT_ON: Add a point in front of char.
 * @param  Colon: Flag indicating if a colon character has to be added in front
 *                     of displayed character.
 *          This parameter can be one of the following values:
 *              @arg DOUBLEPOINT_OFF: No colon to add in back of char.
 *              @arg DOUBLEPOINT_ON: Add an colon in back of char.
 * @param  Position: Position in the LCD of the character to write.
 *                   This parameter can be any value in range [1:6].
 * @retval None
 * @note   Required preconditions: The LCD should be cleared before to start the
 *         write operation.
 */
void BSP_LCD_GLASS_DisplayChar2(uint8_t *ch, Point_Typedef Point, DoublePoint_Typedef Colon,
		DigitPosition_Typedef Position)
{
	WriteChar2(ch, Point, Colon, Position);

	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/*--------------------------------------------------------------------------------------------*/
/**
 * @brief  Write a character string in the LCD RAM buffer and a dot.
 * @param  ptr: Pointer to string to display on the LCD Glass.
 * @retval None
 */
void BSP_LCD_GLASS_DisplayString_plus_one_dot(uint8_t *ptr, DigitPosition_Typedef pos)
{
	DigitPosition_Typedef position = LCD_DIGIT_POSITION_1;

	/* Send the string character by character on lCD */
	while ((*ptr != 0) && (position <= LCD_DIGIT_POSITION_6))
	{
		/* Write one character on LCD */
		if (position == pos)
			WriteChar(ptr, POINT_ON, DOUBLEPOINT_OFF, position);
		else
			WriteChar(ptr, POINT_OFF, DOUBLEPOINT_OFF, position);

		/* Point on the next character */
		ptr++;

		/* Increment the character counter */
		position++;
	}
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/*--------------------------------------------------------------------------------------------*/
void LCD_GLASS_Display_Dot(Dot_Typedef dot)
{
	switch (dot)
	{
	case LCD_DOT_0:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~LCD_SEG1, LCD_SEG1);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	case LCD_DOT_1:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~LCD_SEG3, LCD_SEG3);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	case LCD_DOT_2:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~LCD_SEG5, LCD_SEG5);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	case LCD_DOT_3:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~LCD_SEG7, LCD_SEG7);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	default:
		break;
	}
}

/*--------------------------------------------------------------------------------------------*/
void LCD_GLASS_Display_Colon(Colon_Typedef colon)
{
	switch (colon)
	{
	case LCD_COLON_0:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~LCD_SEG1, LCD_SEG1);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	case LCD_COLON_1:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~LCD_SEG3, LCD_SEG3);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	case LCD_COLON_2:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~LCD_SEG5, LCD_SEG5);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	case LCD_COLON_3:
		HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~LCD_SEG7, LCD_SEG7);
		/* Update the LCD display */
		HAL_LCD_UpdateDisplayRequest(&LCDHandle);
		break;

	default:
		break;
	}
}

/*--------------------------------------------------------------------------------------------*/
void Dot_colon_LCD_test0(void)
{
	BSP_LCD_GLASS_DisplayString((uint8_t*) "123456");
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~LCD_SEG1, LCD_SEG1);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~LCD_SEG3, LCD_SEG3);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, ~LCD_SEG5, LCD_SEG5);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER7, ~LCD_SEG7, LCD_SEG7);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);

