MrBlueXav/Horlogeuse/Drivers/BSP/STM32L476G-Discovery/STM32L476_DK_glass_lcd_extension.c
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~LCD_SEG1, LCD_SEG1);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~LCD_SEG3, LCD_SEG3);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, ~LCD_SEG5, LCD_SEG5);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
	HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER5, ~LCD_SEG7, LCD_SEG7);
	/* Update the LCD display */
	HAL_LCD_UpdateDisplayRequest(&LCDHandle);
	HAL_Delay(1000);
}

/*--------------------------------------------------------------------------------------------*/
void Dot_colon_LCD_test(void)
{
	BSP_LCD_GLASS_DisplayString((uint8_t*) "abcdef");
	HAL_Delay(1000);

	LCD_GLASS_Display_Dot(LCD_DOT_0);
	HAL_Delay(1000);
	LCD_GLASS_Display_Dot(LCD_DOT_1);
	HAL_Delay(1000);
	LCD_GLASS_Display_Dot(LCD_DOT_2);
	HAL_Delay(1000);
	LCD_GLASS_Display_Dot(LCD_DOT_3);
	HAL_Delay(1000);

	LCD_GLASS_Display_Colon(LCD_COLON_0);
	HAL_Delay(1000);
	LCD_GLASS_Display_Colon(LCD_COLON_1);
	HAL_Delay(1000);
	LCD_GLASS_Display_Colon(LCD_COLON_2);
	HAL_Delay(1000);
	LCD_GLASS_Display_Colon(LCD_COLON_3);
	HAL_Delay(1000);
}

/*--------------------------------------------------------------------------------------------*/
void print_all_characters(void)
{
	BSP_LCD_GLASS_Clear();
	uint8_t pos = 0;

	BSP_LCD_GLASS_DisplayChar2((uint8_t*) "µ", POINT_OFF, DOUBLEPOINT_OFF, pos);
	pos++;
	HAL_Delay(500);
	BSP_LCD_GLASS_DisplayChar2((uint8_t*) "°", POINT_OFF, DOUBLEPOINT_OFF, pos);
	pos++;
	HAL_Delay(500);
	BSP_LCD_GLASS_DisplayChar2((uint8_t*) "à", POINT_OFF, DOUBLEPOINT_OFF, pos); /* Non printable character => SYMBOL12 */
	pos++;
	HAL_Delay(500);

	for (uint8_t ch = 32; ch < 145; ch++)
	{
		BSP_LCD_GLASS_DisplayChar2(&ch, POINT_OFF, DOUBLEPOINT_OFF, pos);
		HAL_Delay(500);
		pos++;
		if (pos >= 4)
			{
				pos = 0;
				BSP_LCD_GLASS_Clear();
			}
	}
}
